Autodesk.Revit.DB.TextNode.GetFormattedTextRuns
Returns a list of separated runs of formated text.
Returns:
A collection of instances of Autodesk.Revit.DB.FormattedTextRun.
Since:
2016

Autodesk.Revit.DB.TextNode.VerticalAlignment
Vertical alignment of the text content within the text area of the element.
Since:
2016

Autodesk.Revit.DB.TextNode.HorizontalAlignment
Horizontal alignment of the text content within the text area of the element.
Since:
2016

Autodesk.Revit.DB.TextNode.IsKeptReadable
A flag controling how text behaves inside a rotated text object.
Remarks:
If the property is True then the text inside the text box gets oriented
so it is readable when looking straight up at the sheet or from its right side;
in other words, the text would never be upside down.
If the value is False, however, the text's orientation strictly follows
the rotation of the text box, which means the text may be upside down when
viewed on screen or printed on a sheet.
Since:
2016

Autodesk.Revit.DB.TextNode.IsUnderlined
Indicates whether the text style is set to underlined text.
Since:
2016

Autodesk.Revit.DB.TextNode.IsItalic
Indicates whether the text style is set to italic text.
Since:
2016

Autodesk.Revit.DB.TextNode.IsBold
Indicates whether the text style is set to bold text.
Since:
2016

Autodesk.Revit.DB.TextNode.TabSize
The size of one tabulator space.
Since:
2016

Autodesk.Revit.DB.TextNode.FontHeight
Height [ft] of the font including both the typographic ascender and descender.
Since:
2016

Autodesk.Revit.DB.TextNode.TextSize
Height [ft] of the text.
Remarks:
The value specifies the hight of the text excluding both the ascender and descender.
It is appoximatelly the hight of capital leters in the font.
Since:
2016

Autodesk.Revit.DB.TextNode.Height
Height [ft] of the area of the text content.
Since:
2016

Autodesk.Revit.DB.TextNode.WidthScale
Horizontal scale applied to the text.
Since:
2016

Autodesk.Revit.DB.TextNode.Width
Width [ft] of the area of the text content.
Remarks:
The value represents units in the the model space.
Since:
2016

Autodesk.Revit.DB.TextNode.UpDirection
Direction along the vertical axis of letters of the text object (in model space).
Since:
2016

Autodesk.Revit.DB.TextNode.BaseDirection
Direction of the base line of the text object (in model space).
Since:
2016

Autodesk.Revit.DB.TextNode.Position
Position of the text (in model coordinates.)
Since:
2016

Autodesk.Revit.DB.TextNode.Text
The content of the text annotation as a plain string stripped of all formating.
Remarks:
The text may contain new-lines if there are any in the text annotation.
Since:
2016